Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
</registers>

</peripheral>
<peripheral derivedFrom="CAN1">
    <name>CAN2</name>
    <baseAddress>0x40006800</baseAddress>
    <interrupt>
        <name>CAN2_TX</name>
        <description>CAN2 TX interrupts</description>
        <value>63</value>
    </interrupt>
    <interrupt>
        <name>CAN2_RX0</name>
        <description>CAN2 RX0 interrupts</description>
        <value>64</value>
    </interrupt>
    <interrupt>
        <name>CAN2_RX1</name>
        <description>CAN2 RX1 interrupts</description>
        <value>65</value>
    </interrupt>
    <interrupt>
        <name>CAN2_SCE</name>
        <description>CAN2 SCE interrupt</description>
        <value>66</value>
    </interrupt>
</peripheral>

<peripheral>
    <name>CRC</name>
    <description>cyclic redundancy check</description>
    <groupName>CRC</groupName>
    <baseAddress>0x40023000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>CRC32DAT</name>
  <displayName>CRC32DAT</displayName>
  <description>CRC32DAT</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CRC32DAT</name>
      <description>CRC32DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC32IDAT</name>
  <displayName>CRC32IDAT</displayName>
  <description>CRC32IDAT</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>CRC32IDAT</name>
      <description>CRC32IDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC32CTRL</name>
  <displayName>CRC32CTRL</displayName>
  <description>CRC32CTRL</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>RESET</name>
      <description>RESET</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16CTRL</name>
  <displayName>CRC16CTRL</displayName>
  <description>CRC16CTRL</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>ENDHL</name>
      <description>ENDHL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLR</name>
      <description>CLR</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16DAT</name>
  <displayName>CRC16DAT</displayName>
  <description>CRC16DAT</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>CRC16DAT</name>
      <description>CRC16DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16D</name>
  <displayName>CRC16D</displayName>
  <description>CRC16D</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CRC16D</name>
      <description>CRC16D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>LRC</name>
  <displayName>LRC</displayName>
  <description>LRC</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>LRCDAT</name>
      <description>LRCDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>DAC</name>
    <description>digital to analog converter</description>
    <groupName>DAC</groupName>
    <baseAddress>0x40007400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>DAC_CTRL</name>
  <displayName>DAC_CTRL</displayName>
  <description>DAC_CTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x1fff1fff</resetMask>
  <fields>
    <field>
      <name>CH1EN</name>
      <description>CH1EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>B1EN</name>
      <description>B1EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>T1EN</name>
      <description>T1EN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>T1SEL</name>
      <description>T1SEL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>W1EN</name>
      <description>W1EN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MA1SEL</name>
      <description>MA1SEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DMA1EN</name>
      <description>DMA1EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__CH2EN</name>
      <description>__CH2EN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__B2EN</name>
      <description>__B2EN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__T2EN</name>
      <description>__T2EN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>T2SEL</name>
      <description>T2SEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>W2EN</name>
      <description>W2EN</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MA2SEL</name>
      <description>MA2SEL</description>
      <bitOffset>24</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DMA2EN</name>
      <description>DMA2EN</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_SOTTR</name>
  <displayName>DAC_SOTTR</displayName>
  <description>DAC_SOTTR</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>TR1EN</name>
      <description>TR1EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TR2EN</name>
      <description>TR2EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR12CH1</name>
  <displayName>DAC_DR12CH1</displayName>
  <description>DAC_DR12CH1</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DL12CH1</name>
  <displayName>DAC_DL12CH1</displayName>
  <description>DAC_DL12CH1</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000fff0</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>4</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR8CH1</name>
  <displayName>DAC_DR8CH1</displayName>
  <description>DAC_DR8CH1</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR12CH2</name>
  <displayName>DAC_DR12CH2</displayName>
  <description>DAC_DR12CH2</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DL12CH2</name>
  <displayName>DAC_DL12CH2</displayName>
  <description>DAC_DL12CH2</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000fff0</resetMask>
  <fields>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>4</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR8CH2</name>
  <displayName>DAC_DR8CH2</displayName>
  <description>DAC_DR8CH2</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR12DCH</name>
  <displayName>DAC_DR12DCH</displayName>
  <description>DAC_DR12DCH</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0fff0fff</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>16</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DL12DCH</name>
  <displayName>DAC_DL12DCH</displayName>
  <description>DAC_DL12DCH</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xfff0fff0</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>4</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>20</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DR8DCH</name>
  <displayName>DAC_DR8DCH</displayName>
  <description>DAC_DR8DCH</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DACCH1D</name>
      <description>DACCH1D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DACCH2D</name>
      <description>DACCH2D</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DATO1</name>
  <displayName>DAC_DATO1</displayName>
  <description>DAC_DATO1</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>DACCH1DO</name>
      <description>DACCH1DO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DAC_DATO2</name>
  <displayName>DAC_DATO2</displayName>
  <description>DAC_DATO2</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>DACCH2DO</name>
      <description>DACCH2DO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
