Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
<register>
  <name>DMA_MADDR8</name>
  <displayName>DMA_MADDR8</displayName>
  <description>DMA_MADDR8</description>
  <addressOffset>0xa0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL8</name>
  <displayName>DMA_CHSEL8</displayName>
  <description>DMA_CHSEL8</description>
  <addressOffset>0xa4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHMAPEN</name>
  <displayName>DMA_CHMAPEN</displayName>
  <description>DMA_CHMAPEN</description>
  <addressOffset>0xa8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>MAP_EN</name>
      <description>MAP_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>
<peripheral>
    <name>DMA2</name>
    <description>DMA2: Direct memory access controller</description>
    <groupName>DMA2</groupName>
    <baseAddress>0x40020400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>DMA2_Channel1</name>
        <description>DMA2 channel1 interrupt</description>
        <value>56</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel2</name>
        <description>DMA2 channel2 interrupt</description>
        <value>57</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel3</name>
        <description>DMA2 channel3 interrupt</description>
        <value>58</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel4</name>
        <description>DMA2 channel4 interrupt</description>
        <value>59</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel5</name>
        <description>DMA2 channel5 interrupt</description>
        <value>60</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel6</name>
        <description>DMA2 channel6 interrupt</description>
        <value>68</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel7</name>
        <description>DMA2 channel7 interrupt</description>
        <value>69</value>
    </interrupt>
    <interrupt>
        <name>DMA2_Channel8</name>
        <description>DMA2 channel8 interrupt</description>
        <value>77</value>
    </interrupt>
                <registers>
<register>
  <name>DMA_INTSTS</name>
  <displayName>DMA_INTSTS</displayName>
  <description>DMA_INTSTS</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>GLBF1</name>
      <description>GLBF1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF1</name>
      <description>TXCF1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF1</name>
      <description>HTXF1</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF1</name>
      <description>ERRF1</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF2</name>
      <description>GLBF2</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF2</name>
      <description>TXCF2</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF2</name>
      <description>HTXF2</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF2</name>
      <description>ERRF2</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF3</name>
      <description>GLBF3</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF3</name>
      <description>TXCF3</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF3</name>
      <description>HTXF3</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF3</name>
      <description>ERRF3</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF4</name>
      <description>GLBF4</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF4</name>
      <description>TXCF4</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF4</name>
      <description>HTXF4</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF4</name>
      <description>ERRF4</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF5</name>
      <description>GLBF5</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF5</name>
      <description>TXCF5</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF5</name>
      <description>HTXF5</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF5</name>
      <description>ERRF5</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF6</name>
      <description>GLBF6</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF6</name>
      <description>TXCF6</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF6</name>
      <description>HTXF6</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF6</name>
      <description>ERRF6</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF7</name>
      <description>GLBF7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF7</name>
      <description>TXCF7</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF7</name>
      <description>HTXF7</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF7</name>
      <description>ERRF7</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBF8</name>
      <description>GLBF8</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCF8</name>
      <description>TXCF8</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXF8</name>
      <description>HTXF8</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRF8</name>
      <description>ERRF8</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_INTCLR</name>
  <displayName>DMA_INTCLR</displayName>
  <description>DMA_INTCLR</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CGLBF1</name>
      <description>CGLBF1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF1</name>
      <description>CTXCF1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF1</name>
      <description>CHTXF1</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF1</name>
      <description>CERRF1</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF2</name>
      <description>CGLBF2</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF2</name>
      <description>CTXCF2</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF2</name>
      <description>CHTXF2</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF2</name>
      <description>CERRF2</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF3</name>
      <description>CGLBF3</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF3</name>
      <description>CTXCF3</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF3</name>
      <description>CHTXF3</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF3</name>
      <description>CERRF3</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF4</name>
      <description>CGLBF4</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF4</name>
      <description>CTXCF4</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF4</name>
      <description>CHTXF4</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF4</name>
      <description>CERRF4</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF5</name>
      <description>CGLBF5</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF5</name>
      <description>CTXCF5</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF5</name>
      <description>CHTXF5</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF5</name>
      <description>CERRF5</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF6</name>
      <description>CGLBF6</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF6</name>
      <description>CTXCF6</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF6</name>
      <description>CHTXF6</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF6</name>
      <description>CERRF6</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF7</name>
      <description>CGLBF7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF7</name>
      <description>CTXCF7</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF7</name>
      <description>CHTXF7</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF7</name>
      <description>CERRF7</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CGLBF8</name>
      <description>CGLBF8</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTXCF8</name>
      <description>CTXCF8</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHTXF8</name>
      <description>CHTXF8</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CERRF8</name>
      <description>CERRF8</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG1</name>
  <displayName>DMA_CHCFG1</displayName>
  <description>DMA_CHCFG1</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM1</name>
  <displayName>DMA_TXNUM1</displayName>
  <description>DMA_TXNUM1</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR1</name>
  <displayName>DMA_PADDR1</displayName>
  <description>DMA_PADDR1</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR1</name>
  <displayName>DMA_MADDR1</displayName>
  <description>DMA_MADDR1</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL1</name>
  <displayName>DMA_CHSEL1</displayName>
  <description>DMA_CHSEL1</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG2</name>
  <displayName>DMA_CHCFG2</displayName>
  <description>DMA_CHCFG2</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM2</name>
  <displayName>DMA_TXNUM2</displayName>
  <description>DMA_TXNUM2</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR2</name>
  <displayName>DMA_PADDR2</displayName>
  <description>DMA_PADDR2</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR2</name>
  <displayName>DMA_MADDR2</displayName>
  <description>DMA_MADDR2</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL2</name>
  <displayName>DMA_CHSEL2</displayName>
  <description>DMA_CHSEL2</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG3</name>
  <displayName>DMA_CHCFG3</displayName>
  <description>DMA_CHCFG3</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM3</name>
  <displayName>DMA_TXNUM3</displayName>
  <description>DMA_TXNUM3</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
