Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
</registers>

</peripheral>

<peripheral>
    <name>QSPI</name>
    <description>Queued SPI</description>
    <groupName>QSPI</groupName>
    <baseAddress>0xA0001000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>QSPI</name>
        <description>QSPI global interrupt</description>
        <value>67</value>
    </interrupt>
    <registers>
<register>
  <name>QSPI_CTRL0</name>
  <displayName>QSPI_CTRL0</displayName>
  <description>QSPI_CTRL0</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00804407</resetValue>
  <resetMask>0x00cf6fdf</resetMask>
  <fields>
    <field>
      <name>DFS</name>
      <description>DFS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>FRF</name>
      <description>FRF</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SCPH</name>
      <description>SCPH</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SCPOL</name>
      <description>SCPOL</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TMOD</name>
      <description>TMOD</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SRL</name>
      <description>SRL</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SSTE</name>
      <description>SSTE</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CFS</name>
      <description>CFS</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>SPI_FRF</name>
      <description>SPI_FRF</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_CTRL1</name>
  <displayName>QSPI_CTRL1</displayName>
  <description>QSPI_CTRL1</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDF</name>
      <description>NDF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_EN</name>
  <displayName>QSPI_EN</displayName>
  <description>QSPI_EN</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>QEN</name>
      <description>QEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_MW_CTRL</name>
  <displayName>QSPI_MW_CTRL</displayName>
  <description>QSPI_MW_CTRL</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>MWMOD</name>
      <description>MWMOD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MC_DIR</name>
      <description>MC_DIR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MHS_EN</name>
      <description>MHS_EN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_SLAVE_EN</name>
  <displayName>QSPI_SLAVE_EN</displayName>
  <description>QSPI_SLAVE_EN</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>SEN</name>
      <description>SEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_BAUD</name>
  <displayName>QSPI_BAUD</displayName>
  <description>QSPI_BAUD</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLK_DIV</name>
      <description>CLK_DIV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_TXFT</name>
  <displayName>QSPI_TXFT</displayName>
  <description>QSPI_TXFT</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x001f001f</resetMask>
  <fields>
    <field>
      <name>TXFT_TEI</name>
      <description>TXFT_TEI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>TXFT_ST</name>
      <description>TXFT_ST</description>
      <bitOffset>16</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RXFT</name>
  <displayName>QSPI_RXFT</displayName>
  <description>QSPI_RXFT</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000001f</resetMask>
  <fields>
    <field>
      <name>RXFT_TFI</name>
      <description>RXFT_TFI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_TXFN</name>
  <displayName>QSPI_TXFN</displayName>
  <description>QSPI_TXFN</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>TXFN</name>
      <description>TXFN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RXFN</name>
  <displayName>QSPI_RXFN</displayName>
  <description>QSPI_RXFN</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>RXFN</name>
      <description>RXFN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_STS</name>
  <displayName>QSPI_STS</displayName>
  <description>QSPI_STS</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000006</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>BUSY</name>
      <description>BUSY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFNF</name>
      <description>TXFNF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFE</name>
      <description>TXFE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFNE</name>
      <description>RXFNE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFF</name>
      <description>RXFF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DC_ERR</name>
      <description>DC_ERR</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_IMASK</name>
  <displayName>QSPI_IMASK</displayName>
  <description>QSPI_IMASK</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000007f</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>TXFEIM</name>
      <description>TXFEIM</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFOIM</name>
      <description>TXFOIM</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFUIM</name>
      <description>RXFUIM</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFOIM</name>
      <description>RXFOIM</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFFIM</name>
      <description>RXFFIM</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCIM</name>
      <description>MMCIM</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XRXOIM</name>
      <description>XRXOIM</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_ISTS</name>
  <displayName>QSPI_ISTS</displayName>
  <description>QSPI_ISTS</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>TXFEIS</name>
      <description>TXFEIS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFOIS</name>
      <description>TXFOIS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFUIS</name>
      <description>RXFUIS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFOIS</name>
      <description>RXFOIS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFFIS</name>
      <description>RXFFIS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCIS</name>
      <description>MMCIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XRXOIS</name>
      <description>XRXOIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RISTS</name>
  <displayName>QSPI_RISTS</displayName>
  <description>QSPI_RISTS</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>TXFERIS</name>
      <description>TXFERIS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFORIS</name>
      <description>TXFORIS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFURIS</name>
      <description>RXFURIS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFORIS</name>
      <description>RXFORIS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXFFRIS</name>
      <description>RXFFRIS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCRIS</name>
      <description>MMCRIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XRXORIS</name>
      <description>XRXORIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_TXFOI_CLR</name>
  <displayName>QSPI_TXFOI_CLR</displayName>
  <description>QSPI_TXFOI_CLR</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>TXFOIC</name>
      <description>TXFOIC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RXFOI_CLR</name>
  <displayName>QSPI_RXFOI_CLR</displayName>
  <description>QSPI_RXFOI_CLR</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>RXFOIC</name>
      <description>RXFOIC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RXFUI_CLR</name>
  <displayName>QSPI_RXFUI_CLR</displayName>
  <description>QSPI_RXFUI_CLR</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>RXFUIC</name>
      <description>RXFUIC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_MMCI_CLR</name>
  <displayName>QSPI_MMCI_CLR</displayName>
  <description>QSPI_MMCI_CLR</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>MMCIC</name>
      <description>MMCIC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_ICLR</name>
  <displayName>QSPI_ICLR</displayName>
  <description>QSPI_ICLR</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>INTC</name>
      <description>INTC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_DMA_CTRL</name>
  <displayName>QSPI_DMA_CTRL</displayName>
  <description>QSPI_DMA_CTRL</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>RX_DMA_EN</name>
      <description>RX_DMA_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TX_DMA_EN</name>
      <description>TX_DMA_EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_DMATDL_CTRL</name>
  <displayName>QSPI_DMATDL_CTRL</displayName>
  <description>QSPI_DMATDL_CTRL</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>DMATDL</name>
      <description>DMATDL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_DMARDL_CTRL</name>
  <displayName>QSPI_DMARDL_CTRL</displayName>
  <description>QSPI_DMARDL_CTRL</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>DMARDL</name>
      <description>DMARDL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_DATx</name>
  <displayName>QSPI_DATx</displayName>
  <description>QSPI_DATx</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATx</name>
      <description>DATx</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_RS_DELAY</name>
  <displayName>QSPI_RS_DELAY</displayName>
  <description>QSPI_RS_DELAY</description>
  <addressOffset>0xf0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000100ff</resetMask>
  <fields>
    <field>
      <name>SDCN</name>
      <description>SDCN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>SES</name>
      <description>SES</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_ENH_CTRL0</name>
  <displayName>QSPI_ENH_CTRL0</displayName>
  <description>QSPI_ENH_CTRL0</description>
  <addressOffset>0xf4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00020000</resetValue>
  <resetMask>0x4c3bfbbf</resetMask>
  <fields>
    <field>
      <name>TRANS_TYPE</name>
      <description>TRANS_TYPE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>ADDR_LEN</name>
      <description>ADDR_LEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>INST_L</name>
      <description>INST_L</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>WAIT_CYCLES</name>
      <description>WAIT_CYCLES</description>
      <bitOffset>11</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SPI_DDR_EN</name>
      <description>SPI_DDR_EN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INST_DDR_EN</name>
      <description>INST_DDR_EN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLK_STRETCH_EN</name>
      <description>CLK_STRETCH_EN</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>QSPI_DDR_TXDE</name>
  <displayName>QSPI_DDR_TXDE</displayName>
  <description>QSPI_DDR_TXDE</description>
  <addressOffset>0xf8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>TXDE</name>
      <description>TXDE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_MODE</name>
  <displayName>XIP_MODE</displayName>
  <description>XIP_MODE</description>
  <addressOffset>0xfc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>XIP_MD_BITS</name>
      <description>XIP_MD_BITS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_INCR_TOC</name>
  <displayName>XIP_INCR_TOC</displayName>
  <description>XIP_INCR_TOC</description>
  <addressOffset>0x100</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>ITOC</name>
      <description>ITOC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_WRAP_TOC</name>
  <displayName>XIP_WRAP_TOC</displayName>
  <description>XIP_WRAP_TOC</description>
  <addressOffset>0x104</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>WTOC</name>
      <description>WTOC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_CTRL</name>
  <displayName>XIP_CTRL</displayName>
  <description>XIP_CTRL</description>
  <addressOffset>0x108</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0cdff6ff</resetMask>
  <fields>
    <field>
      <name>FRF</name>
      <description>FRF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TRANS_TYPE</name>
      <description>TRANS_TYPE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>ADDR_LEN</name>
      <description>ADDR_LEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>INST_L</name>
      <description>INST_L</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MD_BITS_EN</name>
      <description>MD_BITS_EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WAIT_CYCLES</name>
      <description>WAIT_CYCLES</description>
      <bitOffset>13</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>DFS_HC</name>
      <description>DFS_HC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DDR_EN</name>
      <description>DDR_EN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INST_DDR_EN</name>
      <description>INST_DDR_EN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XIP_INST_EN</name>
      <description>XIP_INST_EN</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XIP_CT_EN</name>
      <description>XIP_CT_EN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>XIP_MBL</name>
      <description>XIP_MBL</description>
      <bitOffset>26</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_SLAVE_EN</name>
  <displayName>XIP_SLAVE_EN</displayName>
  <description>XIP_SLAVE_EN</description>
  <addressOffset>0x10c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>SEN</name>
      <description>SEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_RXFOI_CLR</name>
  <displayName>XIP_RXFOI_CLR</displayName>
  <description>XIP_RXFOI_CLR</description>
  <addressOffset>0x110</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>XRXFOIC</name>
      <description>XRXFOIC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>XIP_TOUT</name>
  <displayName>XIP_TOUT</displayName>
  <description>XIP_TOUT</description>
  <addressOffset>0x114</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>XTOUT</name>
      <description>XTOUT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
