Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
</registers>

</peripheral>

<peripheral>
    <name>OPAMP</name>
    <description>operational amplifier</description>
    <groupName>OPAMP</groupName>
    <baseAddress>0x40002000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
<register>
  <name>OPA_CS1</name>
  <displayName>OPA_CS1</displayName>
  <description>OPA_CS1</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x003fffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MOD</name>
      <description>MOD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PGAGAN</name>
      <description>PGAGAN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>VMSEL</name>
      <description>VMSEL</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSEL</name>
      <description>VPSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CALON</name>
      <description>CALON</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTREF</name>
      <description>TSTREF</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALOUT</name>
      <description>CALOUT</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RANGE</name>
      <description>RANGE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TCMEN</name>
      <description>TCMEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VMSSEL</name>
      <description>VMSSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSSEL</name>
      <description>VPSSEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>OPA_CS2</name>
  <displayName>OPA_CS2</displayName>
  <description>OPA_CS2</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x003fffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MOD</name>
      <description>MOD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PGAGAN</name>
      <description>PGAGAN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>VMSEL</name>
      <description>VMSEL</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSEL</name>
      <description>VPSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CALON</name>
      <description>CALON</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTREF</name>
      <description>TSTREF</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALOUT</name>
      <description>CALOUT</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RANGE</name>
      <description>RANGE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TCMEN</name>
      <description>TCMEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VMSSEL</name>
      <description>VMSSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSSEL</name>
      <description>VPSSEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>OPA_CS3</name>
  <displayName>OPA_CS3</displayName>
  <description>OPA_CS3</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x003fffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MOD</name>
      <description>MOD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PGAGAN</name>
      <description>PGAGAN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>VMSEL</name>
      <description>VMSEL</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSEL</name>
      <description>VPSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CALON</name>
      <description>CALON</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTREF</name>
      <description>TSTREF</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALOUT</name>
      <description>CALOUT</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RANGE</name>
      <description>RANGE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TCMEN</name>
      <description>TCMEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VMSSEL</name>
      <description>VMSSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSSEL</name>
      <description>VPSSEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>OPA_CS4</name>
  <displayName>OPA_CS4</displayName>
  <description>OPA_CS4</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x003fffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MOD</name>
      <description>MOD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PGAGAN</name>
      <description>PGAGAN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>VMSEL</name>
      <description>VMSEL</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSEL</name>
      <description>VPSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CALON</name>
      <description>CALON</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTREF</name>
      <description>TSTREF</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALOUT</name>
      <description>CALOUT</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RANGE</name>
      <description>RANGE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TCMEN</name>
      <description>TCMEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VMSSEL</name>
      <description>VMSSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>VPSSEL</name>
      <description>VPSSEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>OPA_LOCK</name>
  <displayName>OPA_LOCK</displayName>
  <description>OPA_LOCK</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000000f</resetMask>
  <fields>
    <field>
      <name>OPAMP1LK</name>
      <description>OPAMP1LK</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPAMP2LK</name>
      <description>OPAMP2LK</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPAMP3LK</name>
      <description>OPAMP3LK</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPAMP4LK</name>
      <description>OPAMP4LK</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
