Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
</registers>

</peripheral>

<peripheral>
    <name>COMP</name>
    <description>comparator</description>
    <groupName>COMP</groupName>
    <baseAddress>0x40002400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0xA0</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>COMP_1_2_3</name>
        <description>COMP1/2/3 interrupt</description>
        <value>82</value>
    </interrupt>
    <interrupt>
        <name>COMP_4_5_6</name>
        <description>COMP4/5/6 interrupt</description>
        <value>83</value>
    </interrupt>
    <interrupt>
        <name>COMP7</name>
        <description>COMP7 interrupt</description>
        <value>84</value>
    </interrupt>
                <registers>
<register>
  <name>COMP1_CTRL</name>
  <displayName>COMP1_CTRL</displayName>
  <description>COMP1_CTRL</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP1_FILC</name>
  <displayName>COMP1_FILC</displayName>
  <description>COMP1_FILC</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP1_FILP</name>
  <displayName>COMP1_FILP</displayName>
  <description>COMP1_FILP</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP2_CTRL</name>
  <displayName>COMP2_CTRL</displayName>
  <description>COMP2_CTRL</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP2_FILC</name>
  <displayName>COMP2_FILC</displayName>
  <description>COMP2_FILC</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP2_FILP</name>
  <displayName>COMP2_FILP</displayName>
  <description>COMP2_FILP</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP3_CTRL</name>
  <displayName>COMP3_CTRL</displayName>
  <description>COMP3_CTRL</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP3_FILC</name>
  <displayName>COMP3_FILC</displayName>
  <description>COMP3_FILC</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP3_FILP</name>
  <displayName>COMP3_FILP</displayName>
  <description>COMP3_FILP</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP4_CTRL</name>
  <displayName>COMP4_CTRL</displayName>
  <description>COMP4_CTRL</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP4_FILC</name>
  <displayName>COMP4_FILC</displayName>
  <description>COMP4_FILC</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP4_FILP</name>
  <displayName>COMP4_FILP</displayName>
  <description>COMP4_FILP</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP5_CTRL</name>
  <displayName>COMP5_CTRL</displayName>
  <description>COMP5_CTRL</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP5_FILC</name>
  <displayName>COMP5_FILC</displayName>
  <description>COMP5_FILC</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP5_FILP</name>
  <displayName>COMP5_FILP</displayName>
  <description>COMP5_FILP</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP6_CTRL</name>
  <displayName>COMP6_CTRL</displayName>
  <description>COMP6_CTRL</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP6_FILC</name>
  <displayName>COMP6_FILC</displayName>
  <description>COMP6_FILC</description>
  <addressOffset>0x64</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP6_FILP</name>
  <displayName>COMP6_FILP</displayName>
  <description>COMP6_FILP</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP7_CTRL</name>
  <displayName>COMP7_CTRL</displayName>
  <description>COMP7_CTRL</description>
  <addressOffset>0x70</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>EN</name>
      <description>EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INMSEL</name>
      <description>INMSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>INPSEL</name>
      <description>INPSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>POL</name>
      <description>POL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HYST</name>
      <description>HYST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BLKING</name>
      <description>BLKING</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OUT</name>
      <description>OUT</description>
      <bitOffset>17</bitOffset>
      <access>read-only</access>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INPDAC</name>
      <description>INPDAC</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP7_FILC</name>
  <displayName>COMP7_FILC</displayName>
  <description>COMP7_FILC</description>
  <addressOffset>0x74</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FILEN</name>
      <description>FILEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>THRESH</name>
      <description>THRESH</description>
      <bitOffset>1</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SAMPW</name>
      <description>SAMPW</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP7_FILP</name>
  <displayName>COMP7_FILP</displayName>
  <description>COMP7_FILP</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPSC</name>
      <description>CLKPSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP_WINMODE</name>
  <displayName>COMP_WINMODE</displayName>
  <description>COMP_WINMODE</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>CMP12MD</name>
      <description>CMP12MD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP34MD</name>
      <description>CMP34MD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP56MD</name>
      <description>CMP56MD</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP_LOCK</name>
  <displayName>COMP_LOCK</displayName>
  <description>COMP_LOCK</description>
  <addressOffset>0x84</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CMP1LK</name>
      <description>CMP1LK</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP2LK</name>
      <description>CMP2LK</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP3LK</name>
      <description>CMP3LK</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP4LK</name>
      <description>CMP4LK</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP5LK</name>
      <description>CMP5LK</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP6LK</name>
      <description>CMP6LK</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
