Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
<register>
  <name>COMP_INTEN</name>
  <displayName>COMP_INTEN</displayName>
  <description>COMP_INTEN</description>
  <addressOffset>0x8c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>CMP0IEN</name>
      <description>CMP0IEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP1IEN</name>
      <description>CMP1IEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP2IEN</name>
      <description>CMP2IEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP3IEN</name>
      <description>CMP3IEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP4IEN</name>
      <description>CMP4IEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP5IEN</name>
      <description>CMP5IEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP6IEN</name>
      <description>CMP6IEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP_INTSTS</name>
  <displayName>COMP_INTSTS</displayName>
  <description>COMP_INTSTS</description>
  <addressOffset>0x90</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>CMP1IS</name>
      <description>CMP1IS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP2IS</name>
      <description>CMP2IS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP3IS</name>
      <description>CMP3IS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP4IS</name>
      <description>CMP4IS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP5IS</name>
      <description>CMP5IS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP6IS</name>
      <description>CMP6IS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMP7IS</name>
      <description>CMP7IS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>COMP_VREFSCL</name>
  <displayName>COMP_VREFSCL</displayName>
  <description>COMP_VREFSCL</description>
  <addressOffset>0x94</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>VV1EN</name>
      <description>VV1EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VV1TRM</name>
      <description>VV1TRM</description>
      <bitOffset>1</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>VV2EN</name>
      <description>VV2EN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VV2TRM</name>
      <description>VV2TRM</description>
      <bitOffset>8</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>TSC</name>
    <description>touch screen control</description>
    <groupName>TSC</groupName>
    <baseAddress>0x40003400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>TSC</name>
        <description>TSC global interrupt</description>
        <value>81</value>
    </interrupt>
    <registers>
<register>
  <name>TSC_CTRL</name>
  <displayName>TSC_CTRL</displayName>
  <description>TSC_CTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000703</resetValue>
  <resetMask>0x000037ff</resetMask>
  <fields>
    <field>
      <name>DET_PERIOD</name>
      <description>DET_PERIOD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DET_FILTER</name>
      <description>DET_FILTER</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>HW_DET_MODE</name>
      <description>HW_DET_MODE</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HW_DET_ST</name>
      <description>HW_DET_ST</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LESS_DET_SEL</name>
      <description>LESS_DET_SEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GREAT_DET_SEL</name>
      <description>GREAT_DET_SEL</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DET_INTEN</name>
      <description>DET_INTEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM4_ETR</name>
      <description>TIM4_ETR</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM2_ETR_CH1</name>
      <description>TIM2_ETR_CH1</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_CHNEN</name>
  <displayName>TSC_CHNEN</displayName>
  <description>TSC_CHNEN</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>CHN_SEL</name>
      <description>CHN_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>24</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_STS</name>
  <displayName>TSC_STS</displayName>
  <description>TSC_STS</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x001f37ff</resetMask>
  <fields>
    <field>
      <name>CNT_VAL</name>
      <description>CNT_VAL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>LESS_DET</name>
      <description>LESS_DET</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GREAT_DET</name>
      <description>GREAT_DET</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHN_NUM</name>
      <description>CHN_NUM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_ANA_CTRL</name>
  <displayName>TSC_ANA_CTRL</displayName>
  <description>TSC_ANA_CTRL</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>SW_PAD_MUX</name>
      <description>SW_PAD_MUX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SW_TSC_EN</name>
      <description>SW_TSC_EN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_ANA_SEL</name>
  <displayName>TSC_ANA_SEL</displayName>
  <description>TSC_ANA_SEL</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000070</resetMask>
  <fields>
    <field>
      <name>SP_OPT</name>
      <description>SP_OPT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PAD_OPT</name>
      <description>PAD_OPT</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_RESR0</name>
  <displayName>TSC_RESR0</displayName>
  <description>TSC_RESR0</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x44444444</resetValue>
  <resetMask>0x77777777</resetMask>
  <fields>
    <field>
      <name>CHN_RESIST0</name>
      <description>CHN_RESIST0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST1</name>
      <description>CHN_RESIST1</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST2</name>
      <description>CHN_RESIST2</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST3</name>
      <description>CHN_RESIST3</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST4</name>
      <description>CHN_RESIST4</description>
      <bitOffset>16</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST5</name>
      <description>CHN_RESIST5</description>
      <bitOffset>20</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST6</name>
      <description>CHN_RESIST6</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST7</name>
      <description>CHN_RESIST7</description>
      <bitOffset>28</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_RESR1</name>
  <displayName>TSC_RESR1</displayName>
  <description>TSC_RESR1</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x44444444</resetValue>
  <resetMask>0x77777777</resetMask>
  <fields>
    <field>
      <name>CHN_RESIST8</name>
      <description>CHN_RESIST8</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST9</name>
      <description>CHN_RESIST9</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST10</name>
      <description>CHN_RESIST10</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST11</name>
      <description>CHN_RESIST11</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST12</name>
      <description>CHN_RESIST12</description>
      <bitOffset>16</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST13</name>
      <description>CHN_RESIST13</description>
      <bitOffset>20</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST14</name>
      <description>CHN_RESIST14</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST15</name>
      <description>CHN_RESIST15</description>
      <bitOffset>28</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_RESR2</name>
  <displayName>TSC_RESR2</displayName>
  <description>TSC_RESR2</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x44444444</resetValue>
  <resetMask>0x77777777</resetMask>
  <fields>
    <field>
      <name>CHN_RESIST16</name>
      <description>CHN_RESIST16</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST17</name>
      <description>CHN_RESIST17</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST18</name>
      <description>CHN_RESIST18</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST19</name>
      <description>CHN_RESIST19</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST20</name>
      <description>CHN_RESIST20</description>
      <bitOffset>16</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST21</name>
      <description>CHN_RESIST21</description>
      <bitOffset>20</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST22</name>
      <description>CHN_RESIST22</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>CHN_RESIST23</name>
      <description>CHN_RESIST23</description>
      <bitOffset>28</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD0</name>
  <displayName>TSC_THRHD0</displayName>
  <description>TSC_THRHD0</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE0</name>
      <description>BASE0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA0</name>
      <description>DELTA0</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD1</name>
  <displayName>TSC_THRHD1</displayName>
  <description>TSC_THRHD1</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE1</name>
      <description>BASE1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA1</name>
      <description>DELTA1</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD2</name>
  <displayName>TSC_THRHD2</displayName>
  <description>TSC_THRHD2</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE2</name>
      <description>BASE2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA2</name>
      <description>DELTA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD3</name>
  <displayName>TSC_THRHD3</displayName>
  <description>TSC_THRHD3</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE3</name>
      <description>BASE3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA3</name>
      <description>DELTA3</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD4</name>
  <displayName>TSC_THRHD4</displayName>
  <description>TSC_THRHD4</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE4</name>
      <description>BASE4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA4</name>
      <description>DELTA4</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD5</name>
  <displayName>TSC_THRHD5</displayName>
  <description>TSC_THRHD5</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE5</name>
      <description>BASE5</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA5</name>
      <description>DELTA5</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD6</name>
  <displayName>TSC_THRHD6</displayName>
  <description>TSC_THRHD6</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE6</name>
      <description>BASE6</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA6</name>
      <description>DELTA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD7</name>
  <displayName>TSC_THRHD7</displayName>
  <description>TSC_THRHD7</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE7</name>
      <description>BASE7</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA7</name>
      <description>DELTA7</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD8</name>
  <displayName>TSC_THRHD8</displayName>
  <description>TSC_THRHD8</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE8</name>
      <description>BASE8</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA8</name>
      <description>DELTA8</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD9</name>
  <displayName>TSC_THRHD9</displayName>
  <description>TSC_THRHD9</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE9</name>
      <description>BASE9</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA9</name>
      <description>DELTA9</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD10</name>
  <displayName>TSC_THRHD10</displayName>
  <description>TSC_THRHD10</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE10</name>
      <description>BASE10</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA10</name>
      <description>DELTA10</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD11</name>
  <displayName>TSC_THRHD11</displayName>
  <description>TSC_THRHD11</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE11</name>
      <description>BASE11</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA11</name>
      <description>DELTA11</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD12</name>
  <displayName>TSC_THRHD12</displayName>
  <description>TSC_THRHD12</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE12</name>
      <description>BASE12</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA12</name>
      <description>DELTA12</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD13</name>
  <displayName>TSC_THRHD13</displayName>
  <description>TSC_THRHD13</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE13</name>
      <description>BASE13</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA13</name>
      <description>DELTA13</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD14</name>
  <displayName>TSC_THRHD14</displayName>
  <description>TSC_THRHD14</description>
  <addressOffset>0x5c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE14</name>
      <description>BASE14</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA14</name>
      <description>DELTA14</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD15</name>
  <displayName>TSC_THRHD15</displayName>
  <description>TSC_THRHD15</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE15</name>
      <description>BASE15</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA15</name>
      <description>DELTA15</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD16</name>
  <displayName>TSC_THRHD16</displayName>
  <description>TSC_THRHD16</description>
  <addressOffset>0x64</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE16</name>
      <description>BASE16</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA16</name>
      <description>DELTA16</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
