Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G455.svd
<register>
  <name>TSC_THRHD17</name>
  <displayName>TSC_THRHD17</displayName>
  <description>TSC_THRHD17</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE17</name>
      <description>BASE17</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA17</name>
      <description>DELTA17</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD18</name>
  <displayName>TSC_THRHD18</displayName>
  <description>TSC_THRHD18</description>
  <addressOffset>0x6c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE18</name>
      <description>BASE18</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA18</name>
      <description>DELTA18</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD19</name>
  <displayName>TSC_THRHD19</displayName>
  <description>TSC_THRHD19</description>
  <addressOffset>0x70</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE19</name>
      <description>BASE19</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA19</name>
      <description>DELTA19</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD20</name>
  <displayName>TSC_THRHD20</displayName>
  <description>TSC_THRHD20</description>
  <addressOffset>0x74</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE20</name>
      <description>BASE20</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA20</name>
      <description>DELTA20</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD21</name>
  <displayName>TSC_THRHD21</displayName>
  <description>TSC_THRHD21</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE21</name>
      <description>BASE21</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA21</name>
      <description>DELTA21</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD22</name>
  <displayName>TSC_THRHD22</displayName>
  <description>TSC_THRHD22</description>
  <addressOffset>0x7c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE22</name>
      <description>BASE22</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA22</name>
      <description>DELTA22</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD23</name>
  <displayName>TSC_THRHD23</displayName>
  <description>TSC_THRHD23</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE23</name>
      <description>BASE23</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA23</name>
      <description>DELTA23</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>WWDG</name>
    <description>window watchdog</description>
    <groupName>WWDG</groupName>
    <baseAddress>0x40002C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>WWDG</name>
        <description>WWDG interrupt</description>
        <value>0</value>
    </interrupt>
    <registers>
        <register>
            <name>WWDG_CTRL</name>
            <displayName>WWDG_CTRL</displayName>
            <description>WWDG_CTRL</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000007f</resetValue>
            <resetMask>0x000000ff</resetMask>
            <fields>
                <field>
                    <name>T</name>
                    <description>T</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>7</bitWidth>
                </field>
                <field>
                    <name>ACTB</name>
                    <description>ACTB</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </register>
        <register>
            <name>WWDG_CFG</name>
            <displayName>WWDG_CFG</displayName>
            <description>WWDG_CFG</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000007f</resetValue>
            <resetMask>0x000003ff</resetMask>
            <fields>
                <field>
                    <name>W</name>
                    <description>W</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>7</bitWidth>
                </field>
                <field>
                    <name>TIMERB</name>
                    <description>TIMERB</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>2</bitWidth>
                </field>
                <field>
                    <name>EWINT</name>
                    <description>EWINT</description>
                    <bitOffset>9</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </register>
        <register>
            <name>WWDG_STS</name>
            <displayName>WWDG_STS</displayName>
            <description>WWDG_STS</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000001</resetMask>
            <fields>
                <field>
                    <name>EWINTF</name>
                    <description>EWINTF</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </register>
    </registers>
</peripheral>

    </peripherals>
</device>
